#include <unistd.h>
#include <fcntl.h>
#include <sys/types.h>
#include <sys/socket.h>
#include <netinet/in.h>

// 2. Описує глобальний дескриптор файла логу.

// 1. Кожна дія сервера супроводжується відміткою у логу.
int log_event(){

    return 0;
}

int daemonize(){

    return 0;
}

int main(){
    // 1. Виконує демонізацію, подальший функціонал стосується демона.
    daemonize()
    // 3. Описує структуру struct sockaddr_in з параметрами: формат сокетів - PF_INET,
    // адреса - будь яка, порт - 3200 + номер варіанта.
    sockaddr_in

    // 4. Формує сокет типу SOCK_STREAM формату PF_INET.
    socket(int __domain, int __type, int __protocol)

    // 5. Налаштовує сокет на очікування запитів за допомогою bind.
    bind(int __fd, const struct sockaddr *__addr, socklen_t __len)

    // 6. Запускає нескінченний цикл обробки запитів від клієнтів.
    while(1){
        poll()
        // 7. На кожний запит виконує fork для породження процесу обробки.
        fork()
        if(getpid() == 1){
            // 9. Процес обробки в нескінченному циклі отримує від клієнта строки за
            // допомогою recv, додає до них свій префікс у вигляді поточного часу та
            // власного pid, та повертає клієнту за допомогою send.
            recv();
        }else{

        }
        // 10. Процес обробки завершує обробку даних від клієнта отримавши строку
        // "close".
    }

    // 8. Батьківський процес закриває сокет.

    return 0;
}
